{
    "rule": [
        {
            "tag": "h1",
            "text": [
                "InCTF Junior 2025 – Official Rules"
            ]
        },
        {
            "tag": "p",
            "text": [
                "India Capture The Flag Junior (\"InCTF Jr\", \"InCTFj\", \"Contest\") is an annual national-level cybersecurity championship exclusively for school students in India, organized by Amrita Vishwa Vidyapeetham, in association with Team bi0s and Traboda CyberLabs Private Limited (collectively, \"Organizers\").",
                "By registering for and participating in the Contest, each participant (\"Participant\") agrees to be bound by the following rules and conditions:"
            ]
        },
        {
            "tag": "h2",
            "text": [
                "Eligibility for Participation"
            ]
        },
        {
            "tag": "p",
            "text": [
                "To be eligible to qualify for the national finals and to receive prizes or awards, each Participant must:"
            ]
        },
        {
            "tag": "ul",
            "text": [
                "Be not more than 19 years of age as of the date of registration.",
                "Be a citizen of the Republic of India.",
                "Not have completed the 12th grade or its equivalent by the time of registration."
            ]
        },
        {
            "tag": "h3",
            "text": [
                "Beginner-Only Policy"
            ]
        },
        {
            "tag": "ul",
            "text": [
                "InCTF Jr is intended to encourage cybersecurity beginners.",
                "Participants found to have prior CTF backgrounds may be disqualified from the Beginner category prizes",
                "The final scoreboard and ranks will be published for transparency, but prizes will only be awarded to eligible beginner participants."
            ]
        },
        {
            "tag": "h3",
            "text": [
                "Experienced Participant Policy"
            ]
        },
        {
            "tag": "ul",
            "text": [
                "While InCTF Junior is primarily aimed at encouraging beginners, we recognize and welcome the participation of school students who already have prior experience in cybersecurity.",
                "Participants who are still in school (i.e., eligible by age and grade) but have prior cybersecurity knowledge or competitive CTF experience (e.g., internships, workshops, advanced courses, past CTF wins, club involvement) are allowed to participate.",
                "The final scoreboard and ranks will be published for transparency. Prize winners under the General Category will be indicated on the scoreboard, allowing all participants to view their rankings."
            ]
        },
        {
            "tag": "h3",
            "text": [
                "Educational Background"
            ]
        },
        {
            "tag": "ul",
            "text": [
                "Participants should be enrolled in a pre-university program (high school, secondary school, etc.).",
                "Students pursuing home schooling, private schooling, distance education, or non-traditional programs must:",
                "Notify the Organizers by email (inctfj@am.amrita.edu).",
                "Undergo a manual eligibility verification process by the Organizers."
            ]
        },
        {
            "tag": "h3",
            "text": [
                "Documents for Verification"
            ]
        },
        {
            "tag": "ul",
            "text": [
                "Participants may be required to provide the following proof of eligibility, especially when selected for prizes:",
                "Aadhaar Card or Indian Passport",
                "School ID Card",
                "Refusal or failure to provide valid proof within the required timeframe may result in disqualification.",
                "Note: Those who do not meet eligibility criteria may still participate for learning purposes, but will not be eligible for prizes or qualification for the finals."
            ]
        },
        {
            "tag": "h2",
            "text": [
                "Cheating & Code of Conduct"
            ]
        },
        {
            "tag": "p",
            "text": [
                "InCTF Jr is an individual event. Collaboration of any kind is strictly prohibited."
            ]
        },
        {
            "tag": "h3",
            "text": [
                "Strictly Prohibited Actions:"
            ]
        },
        {
            "tag": "ul",
            "text": [
                "Collaboration with others or seeking/receiving help.",
                "Sharing or publishing any flags, solutions, or challenge hints.",
                "Asking for help on public platforms, forums, or communities during the Contest.",
                "Using or accepting flags/solutions from other individuals.",
                "Using publicly available resources (tools, documentation, blogs, tutorials) is permitted, provided the Participant is not directly seeking or receiving help from others.",
                "Any Participant found engaging in such prohibited activities will be disqualified immediately, and possibly barred from future editions of the Contest."
            ]
        },
        {
            "tag": "h2",
            "text": [
                "Certificates"
            ]
        },
        {
            "tag": "p",
            "text": [
                "All certificates will be automatically generated based on the profile information entered by the Participant at the time of registration."
            ]
        },
        {
            "tag": "h3",
            "text": [
                "Types of Certificates:"
            ]
        },
        {
            "tag": "ul",
            "text": [
                "Participation Certificate",
                "Eligibility: Awarded to all participants who appear on the scoreboard with a non-zero score (i.e., have solved at least one challenge in the Qualifiers round).",
                "Format: Digital (PDF)",
                "Mode of delivery: Emailed after the Contest ends.",
                "Certificate of Appreciation",
                "Eligibility: Awarded to all participants who appear on the scoreboard and have scored above a predefined threshold (X points) in the Qualifiers round.",
                "(The value of X will be determined by the Organizers based on challenge difficulty and overall performance distribution.)",
                "Format: Digital (PDF)",
                "Mode of delivery: Emailed after the Contest ends.",
                "Certificate of Achievement",
                "Eligibility: Winners of national-level awards/prizes during the finals.",
                "Format: Physical certificate",
                "Mode of delivery: Mailed to the provided postal address."
            ]
        },
        {
            "tag": "h3",
            "text": [
                "Profile Information Responsibility"
            ]
        },
        {
            "tag": "ul",
            "text": [
                "Participants must ensure that all information provided during registration is accurate and up to date.",
                "Profile editing will be allowed only until the start of the Contest.",
                "After the Contest starts, the profile will be locked.",
                "Any corrections must be requested by email (inctfj@am.amrita.edu) within 7 days of the Contest's conclusion.",
                "The Organizers reserve the right to accept or deny such requests."
            ]
        },
        {
            "tag": "h2",
            "text": [
                "Contact & Support"
            ]
        },
        {
            "tag": "p",
            "text": [
                "For all eligibility clarifications, registration queries, or profile corrections, please email:",
                "<a href=\"mailto:inctfj@am.amrita.edu\">📧 inctfj@am.amrita.edu</a>"
            ]
        }
    ]
}